BlazeDemo-Combined-JMeter-and-Selenium.yml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: BlazeDemo-Selenium
  blazegrid: true
  
  capabilities: 
    browserName: chrome
  hold-for: 20m

- executor: jmeter
  scenario: BlazeDemo-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  BlazeDemo-Selenium:
    generate-flow-markers: true 
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - resizeWindow(1366,577)
      - go(chrome://newtab/)
      - go(https://blazedemo.com/)
      - clickByCSS(input.btn.btn-primary)

  BlazeDemo-Http:
    headers:
      Upgrade-Insecure-Requests: '1'
      User-Agent: 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_13_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/88.0.4324.150 Safari/537.36'
      Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9'
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'https://blazedemo.com/'
            method: GET
            label: 'https://blazedemo.com/'
            think-time: 0ms
            headers: {}
          - url: 'https://blazedemo.com/reserve.php'
            method: POST
            label: 'https://blazedemo.com/reserve.php'
            think-time: 3970ms
            headers:
              Content-Type: application/x-www-form-urlencoded
            body:
              fromPort: Paris
              toPort: Buenos Aires